Tekla Open API Reference for Tekla Structures 2025
View.VerticalLabelPosition Enumeration
 The vertical label position types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum VerticalLabelPosition
Public Enumeration VerticalLabelPosition
Members
Member name | Value | Description
Top | 1 |  The label is located on the top of the view.
Bottom | 2 |  The label is located on the bottom of the view.
See Also
Reference
Tekla.Structures.Drawing Namespace